*Задание 3.2*

Предположим, у нас есть дата и время какого-то события и мы хотим посмотреть, к какой дате оно относится для Москвы и для UTC.

Используйте подзапрос

with x as 
(
select '2018-12-31 21:00:00+00'::timestamp with time zone ts
)
и выведите дату в ts в Московском часовом поясе и в поясе UTC.

Столбцы в выдаче: dt_msk (дата в московском часовом поясе), dt_utc (дата в UTC).

In [ ]:
# WITH x AS 
# (
# SELECT '2018-12-31 21:00:00+00'::timestamp WITH time zone ts
# )
# SELECT 
#         (ts at time zone 'Europe/Moscow')::date dt_msk,
#         (ts)::date dt_utc
# FROM x


### <center> ФУНКЦИЯ EXTRACT()

Функция extract() получает из значений даты/времени такие поля, как год или час.

In [ ]:
# SELECT EXTRACT(DAY FROM TIMESTAMP '2001-02-16 20:38:40')
# SELECT EXTRACT(DAY FROM INTERVAL '40 days 1 minute')
# SELECT EXTRACT(HOUR FROM TIMESTAMP '2001-02-16 20:38:40')
# SELECT EXTRAaCT(MONTH FROM TIMESTAMP '2001-02-16 20:38:40');
# SELECT EXTRACT(YEAR FROM TIMESTAMP '2001-02-16 20:38:40');

In [ ]:
# SOYEAR

# Год по недельному календарю ISO 8601, в который попадает дата (не применимо к интервалам).

# SELECT EXTRACT(ISOYEAR FROM DATE '2006-01-01');
# Результат: 2005
# *Год по недельному календарю ISO начинается с понедельника недели, в которой оказывается 4 января,
# так что в начале января или в конце декабря год по ISO может отличаться от года по григорианскому календарю. Подробнее об этом рассказывается в описании поля week.*

In [ ]:
# WEEK

# Номер недели в году по недельному календарю ISO 8601. По определению, недели ISO 8601 начинаются с понедельника, а первая неделя года включает 4 января этого года. Другими словами, первый четверг года всегда оказывается в первой неделе этого года.

# В системе нумерации недель ISO первые числа января могут относиться к 52-й или 53-й неделе предыдущего года, а последние числа декабря — к первой неделе следующего года.

# Например, 2005-01-01 относится к 53-й неделе 2004 г., а 2006-01-01 — к 52-й неделе 2005 г., тогда как 2012-12-31 включается в первую неделю 2013 г.

# Поэтому для получения согласованных результатов рекомендуется использовать поле isoyear в паре с week.

# SELECT EXTRACT(WEEK FROM TIMESTAMP '2001-02-16 20:38:40');
# Результат: 7

In [ ]:
# CENTURY

# SELECT EXTRACT(CENTURY FROM TIMESTAMP '2000-12-16 12:21:13');
# Результат: 20

# SELECT EXTRACT(CENTURY FROM TIMESTAMP '2001-02-16 20:38:40');
# Результат: 21

# Первый век начался 0001-01-01 00:00:00, хотя люди в то время так и не считали. Это определение распространяется на все страны с григорианским календарём.

# Века с номером 0 не было; считается, что 1 наступил после -1.

# Если такое положение вещей вас не устраивает, направляйте жалобы по адресу: Ватикан, Собор Святого Петра, Папе Римскому, лично в руки :)

[Документация](https://lms.skillfactory.ru/courses/course-v1:SkillFactory+DSPR-2.0+14JULY2021/courseware/aa7f767d15ec41758e7d65753e3ecf42/88ba2de9f99b4636a7b488b4a188bfac/?child=first])

Задание 4.1

Давайте посчитаем помесячную статистику по доставкам, используя функцию extract().

Напишите запрос, который выведет год, месяц и количество доставок.
Отсортируйте по году и по месяцу в порядке возрастания.
Столбцы в выдаче: year_n (номер года), month_n (номер месяца), qty (количество доставок).

In [ ]:
# select
#     extract(year from sh.ship_date) year_n ,
#     extract(month from sh.ship_date) month_n,
#     count(sh.ship_id) qty
    
    
# from
#     sql.shipment sh 
# group by 1,2
# order by 1,2

### <center> ФУНКЦИЯ TO_CHAR()

Функция to_char() нужна для форматирования даты времени и интервалов в нужный текст.

Полный перечень вы можете посмотреть в [подсказке по кодам форматирования](https://postgrespro.ru/docs/postgrespro/9.5/functions-formatting)

Любой текст, который относится к кодам форматирования, будет сохранён как есть. Чтобы оставлять какие-то подсказки и использовать обычные буквы, которые не встречаются в таблице выше, необходимо заключить текст, который нужно оставить без изменений, в двойные кавычки.

Задание 4.2

Напишите запрос, который выводит текст "Точное время x часов y минут z секунд" (текст в кавычки заключать не нужно), где x, y, z — часы, минуты и секунды соответственно, при условии, что сообщение нужно вывести для московского часового пояса.
Время введите в 24-часовом формате.
Столбцы в выдаче: msg (сообщение).

In [ ]:
# SELECT to_char(now() at time zone 'Europe/Moscow','Точное время hh24 часов mi минут ss секунд') msg

### <center> ФУНКЦИЯ DATE_TRUNC()

Функция date_trunc() позволяет отсечь заданное время, дату или дату со временем до нужной точности.

Например, если мы хотим округлить текущее время-дату до минут, то можно вызвать

In [ ]:
#  select date_trunc('minute',now())

Для получения разной степени точности вместо minute можно использовать следующие параметры:

microseconds;
milliseconds;
second;
minute;
hour;
day;
week;
month;
quarter;
year;
decade;
century;
millennium.

Задание 4.3

Давайте подготовим данные для квартальной отчётности компании.

Напишите запрос, который выведет дату доставки, округлённую до квартала, и общую массу доставок.
Отсортируйте по кварталу в порядке возрастания.
Столбцы в выдаче: q (начало квартала, тип date), total_weight (сумма масс доставок за квартал).

In [1]:
# SELECT
# 	date_trunc('quarter',s.ship_date)::date y,
# 	sum(s.weight) w
# FROM
# 	shipping.shipment s
# GROUP BY 1
# ORDER BY 1

### <center> МАТЕМАТИЧЕСКИЕ ОПЕРАТОРЫ

К любой дате можно прибавить (и вычесть из неё) целое число X и получить другую дату, которая больше (меньше) изначальной.

In [ ]:
# select '2019-01-01'::date + 10

Результат: '2019-01-11'

In [ ]:
# select '2019-01-01'::date + 500

Результат: '2020-05-15'

In [ ]:
# select '2019-02-10'::date - '2017-03-01'::date

Результат: 711

Задание 4.4

Давайте оценим, в каком интервале совершались доставки в разных городах.

Напишите запрос, который выведет разницу между последним и первым днём доставки по каждому городу.
Отсортируйте по первому и второму столбцам.
Столбцы в выдаче: city_name (название города) и days_active (время от первой до последней доставки в днях).

In [2]:
# SELECT
# 	c.city_name,
# 	max(s.ship_date) - min(s.ship_date) days_active
# FROM
# 	sql.shipment s
# 	join sql.city c on c.city_id = s.city_id
# 	group by c.city_name
# ORDER BY 1, 2

### <center> Строковые данные: основные типы

В Postgres есть три основных типа данных для работы со строками: character(Длина не меняется),

 character varying(Длина не может быть больше, а если меньше то там пробелы)
 
  и text(Любая длина).

### <center>  Функции и операторы для работы со строками

Конструкции с оператором соединения строк записываются следующим образом:

строка1 || строка2 || ... || строкаN

Важно! Если вы соединяете любую строку и NULL, то результатом будет NULL. Поэтому, если вы формируете какой-то текст на основе поля, в котором присутствует NULL, используйте оператор coalesce.

Задание 6.1

Составим текстовый шаблон сообщения о доставке по конкретному водителю для наших клиентов.

Напишите SQL-запрос, который выведет следующее сообщение для каждого водителя по форме:
Ваш заказ доставит водитель #Имя Фамилия#. Его контактный номер: #Номер#, где #Имя Фамилия# и #Номер# взяты из справочника водителей.
Если номер не указан, то выведите прочерк (-). Для номеров рекомендуем использовать coalesce.

Пример из таблицы для наглядности:
Ваш заказ доставит водитель Adel Al-Alawi. Его контактный номер: (901) 947-4433

Столбец к выдаче — msg (текст сообщения).

In [ ]:
# SELECT 
#         'Ваш заказ доставит водитель '||d.first_name||' '||d.last_name||'. '||'Его контактный номер: '||coalesce(d.phone,'-') msg
# FROM shipping.driver d

### <center> ФУНКЦИИ

UPPER() И LOWER()

Функции upper(your_text) и lower(your_text) переводят каждый символ вашего текста в верхний и нижний регистр соответственно.

In [3]:
# select upper('Abc') s1 ,lower('xYz') s2

Задание 6.2

Cоставим справочник названий клиентов, у которых более десяти доставок. Данные сохраним в нижнем регистре, чтобы передавать их в другие системы (например, для обзвона), которые не чувствительны к регистру.

Напишите запрос, который выводит все id названий клиентов, у которых более десяти доставок, в нижнем регистре. Отсортируйте результат по cust_id в порядке возрастания.
Столбцы в выдаче: cust_id (id клиента) и cust_name (название клиента в нижнем регистре).

In [ ]:
# SELECT 
#         c.cust_id,lower(cust_name) cust_name
# FROM shipping.customer c
# JOIN shipping.shipment s ON c.cust_id = s.cust_id
# GROUP BY 1,2
# HAVING COUNT(distinct s.ship_id)>10
# ORDER BY 1

### <center> REPLACE()

Запись строится следующим образом:

replace(string text, from text, to text)

In [ ]:
# select replace('малако','а','о')

Задание 6.3

Составим справочник utm-меток, для того чтобы передавать город и штат прямо в адресной строке. (Если вы не знаете, что такое utm-метка, почитайте статью на Вики. К программе курса это не относится, но знать полезно.)

Напишите SQL-запрос, который выведет список сочетаний из справочника следующего вида: название_штата__название_города, где названия штата и города взяты из справочника городов и переведены в нижний регистр.
Столбец к выдаче — utm (форматированный штат-город).
Отсортируйте полученный справочник по алфавиту.

Обратите внимание! Все пробелы в названиях городов и штатов замените символом '_' (одно нижнее подчёркивание), а для разделения названий города и штата используйте '__' (два последовательных нижних подчёркивания).

Пример из таблицы для наглядности: new_jersey__union_city

In [ ]:
# SELECT 
#         lower(replace(state||'__'||city_name,' ','_')) utm
# FROM shipping.city
# ORDER BY 1

LEFT() И RIGHT()

Функции left(string,n) и right(string,n) отрезают(оставляют) n левых или правых символов от строки, поданной на вход. Давайте разобьём строку 'Один два три' на слова, используя эти функции.

Задание 6.4

Представим, что к вам пришёл разработчик, который хочет сократить поле state в таблице city до четырёх символов, и попросил проверить, останутся ли значения в нём уникальными.

Чтобы ответить на этот вопрос, напишите SQL-запрос, который выведет первые четыре символа названия штата, и количество уникальных названий штатов, которому они соответствуют. Оставьте только те, которые относятся к двум и более штатам.
Добавьте сортировку по первому столбцу.
Столбцы в выдаче: code (четыре первых буквы штата), qty (количество уникальных названий штата, начинаюшихся на эти буквы).

In [ ]:
# SELECT
#                 LEFT(state,4) code, 
#                 COUNT(distinct state) qty
#         FROM shipping.city
#         GROUP BY 1
#     HAVING COUNT(distinct state)>1
# ORDER BY code

### <center> FORMAT()

Функция format() используется для составления форматированного текста с подстановками. То же самое можно сделать через конкатенацию строк, но это неудобно и громоздко.

In [ ]:
# select format('Hello, %s!', d.first_name) from shipping.driver d

Комбинация символов %s обозначает, что вместо них будет подставлен один из аргументов, причём в том же порядке, что и в исходном столбце.

Задание 6.5

Давайте подготовим географическую сводку для каждого города.

Напишите SQL-запрос, который выведет описание региона в следующем формате: [city_name] is located in [state]. There's [population] people living there. Its area is [area] (обратите внимание, точку в конце ставить не нужно).
Отсортируйте по названию города в алфавитном порядке.
Столбец к выдаче — str (сводка).

Пример: Abilene is located in Texas. There's 115930 people living there. Its area is 105.10

In [ ]:
# SELECT
# format(
# $$%s is located in %s. There's %s people living there. Its area is %s$$,c.city_name,c.state,c.population,c.area) str
# FROM shipping.city c
# ORDER BY city_name